# CR Lab â€” SÃ©curisation SSH & Enable Secret

**Module :** Switching Saga / RÃ©seau RÃ©volution â€” RR_SS_05  
**Date :** <!-- Ã  complÃ©ter -->  
**DurÃ©e :** <!-- ex: 1h -->  
**Outil :** Cisco Packet Tracer  
**Niveau :** Formip + Jeremy IT Lab Day 42/48-51

---

## ğŸ¯ Objectifs du lab

- SÃ©curiser l'accÃ¨s au mode privileged (enable secret)
- DÃ©sactiver Telnet et activer SSH v2
- CrÃ©er un utilisateur local avec mot de passe chiffrÃ©
- Restreindre l'accÃ¨s VTY Ã  SSH uniquement
- Tester la connexion SSH depuis un PC

---

## ğŸ—ºï¸ Topologie

```
PC1 (192.168.1.10) â”€â”€ SW1 (192.168.1.1)
                       â””â”€â”€ R1 (192.168.1.254)

SSH accessible depuis PC1 uniquement
```

---

## âŒ¨ï¸ Commandes utilisÃ©es

### Nom de domaine + clÃ© RSA

```cisco
R1(config)# ip domain-name lab.local
R1(config)# crypto key generate rsa modulus 2048
R1(config)# ip ssh version 2
```

### Utilisateur local

```cisco
R1(config)# username admin secret cisco123
```

### SÃ©curisation Enable

```cisco
R1(config)# enable secret cisco1
```

### Configuration VTY (SSH uniquement)

```cisco
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
R1(config-line)# exec-timeout 5 0
R1(config-line)# exit
```

### DÃ©sactiver la console aprÃ¨s inactivitÃ©

```cisco
R1(config)# line console 0
R1(config-line)# exec-timeout 10 0
R1(config-line)# logging synchronous
```

### VÃ©rifications

```cisco
R1# show ip ssh
R1# show users
```

---

## âœ… RÃ©sultats

| Test | RÃ©sultat |
|---|---|
| SSH v2 actif | âœ… |
| Telnet refusÃ© | âœ… |
| Connexion SSH depuis PC1 | âœ… |
| Mot de passe chiffrÃ© dans running-config | âœ… |
| Timeout VTY 5 min | âœ… |

---

## ğŸ’¡ Ce que j'ai appris / DifficultÃ©s

<!-- Ã€ complÃ©ter -->
- âš ï¸ Erreur classique : taper `secret cisco1` sans le mot `enable` devant â†’ commande invalide
- 

---

## ğŸ”— Liens utiles

- [Jeremy IT Lab Day 42 â€” SSH](https://www.youtube.com/watch?v=...)
- [Formip RR_SS_05](https://www.formip.com)
